
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YamatoKato/st-ecs/actions/runs/11433083885)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02b5681a4f3c1ab51]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06652e693df02ece1]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01e1db035ad93125b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f011103d12fdb225]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e4f35268f7682c44]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ad00feb61c4acad5]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07e0f7d85c7dcf1cc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-085c4da19a9dd999a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00f52ada72fadaee0]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c4e9191b86bacf1f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f343a194803308d3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0db9d38d0fa6b6e5e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07157bb44b77124e9]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04105bc1ccc282a1c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-026a1d9efb454c7c3]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f343a194803308d31080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025e9202f0fa47407]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0402c5a94e6c4dd21]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ebf2d5ecb1d9d0b0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9826f32ca19b694]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0649c434aebf2f5d3]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07e0f7d85c7dcf1cc1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e4f35268f7682c441080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "st-go-web-dev-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-02b5681a4f3c1ab51"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "st-go-web-dev-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "st-go-web-dev-ecs"
        }
      + tags_all               = {
          + "Name" = "st-go-web-dev-ecs"
        }
      + vpc_id                 = "vpc-02b5681a4f3c1ab51"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-00f732263e7b7cfbb]
aws_security_group.alb: Creation complete after 4s [id=sg-0a225dea71e25bef2]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 2s [id=sgrule-939008187]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":8,"Program":"tfcmt","SHA1":"582fb937d8abd364f266c5d6131975fe9afb67f1","Vars":{},"WorkflowName":"Terraform"} -->